app/controllers/books_users_controller.rb

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "books" INNER JOIN "books_users" ON "books"."id" = "books_users"."book_id" WHERE "books_users"."user_id" = $1 AND "books"."id" = $2 LIMIT $3  [["user_id", 6], ["id", 1], ["LIMIT", 1]]
---
    def buy
      book = Book.find params[:id]
      unless current_user.books.where(id: params[:id]).any?

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books" INNER JOIN "books_users" ON "books"."id" = "books_users"."book_id" WHERE "books_users"."user_id" = $1 AND "books"."id" = $2 LIMIT $3  [["user_id", 6], ["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "books" INNER JOIN "books_users" ON "books"."id" = "books_users"."book_id" WHERE "books_users"."user_id" = $1 AND "books"."id" = $2 LIMIT $3  [["user_id", 6], ["id", 1], ["LIMIT", 1]]
---
    def cancel
      book = Book.find params[:id]
      if current_user.books.where(id: params[:id]).any?