app/controllers/books_controller.rb

  def show
    @user_buy_current_book = user_signed_in? && current_user.books.where(id: params[:id]).any?
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "books" INNER JOIN "books_users" ON "books"."id" = "books_users"."book_id" WHERE "books_users"."user_id" = $1 AND "books"."id" = $2 LIMIT $3  [["user_id", 6], ["id", 1], ["LIMIT", 1]]

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "description", "price", "author", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", nil], ["description", "интересная книга"], ["price", 1000], ["author", nil], ["created_at", "2024-01-10 08:41:11.843918"], ["updated_at", "2024-01-10 08:41:11.843918"]]

  def destroy
    begin
      authorize @book
    rescue Pundit::NotAuthorizedError
      redirect_to root_path
      return
    end
    @book.destroy!
---
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 1]]